export const enum TdzzXmstatus {

    WBC = 0.0, //未保存

    SB_XJFQ = 0.1, //申报阶段-县级发起申请

    LX_XJFQ = 1.1, //立项阶段-县级待填报
    LX_FWKSH = 1.2, //立项阶段-服务科审核
    LX_FKZXFF = 1.3, //立项阶段-复垦中心分发
    LX_FKZXSH = 1.4, //立项阶段-复垦中心审核
    LX_FWKHZ = 1.5, //立项阶段-服务科汇总
    LX_YTGZC = 1.6, //立项阶段-市及并发环节用途管制处
    LX_KJGHJ = 1.6, //立项阶段-市及并发环节空间规划局
    LX_ZYDCJCC = 1.6, //立项阶段-市及并发环节资源调查监测处
    LX_GBC = 1.6, //立项阶段-市及并发环节耕保处
    LX_FWKHZ2 = 1.7, //立项阶段-服务科汇总
    LX_SJRKFW = 1.8, //立项阶段-市级入库发文
    LX_GBRKPWQR = 1.81, //立项阶段-耕保入库批文确认

    LX_PASS = 1.9, //立项阶段-立项结束通过

    SS_XJFQ = 2.1, //实施阶段-县级发起申请
    SS_SJSH = 2.2, //实施阶段-市级实施审核
    SS_PASS = 2.9, //实施结束通过

    YS_XJFQ = 3.1, //验收阶段-县级发起申请
    YS_JSKSH = 3.2, //验收阶段-技术科审核
    YS_FKZXFF = 3.3, //验收阶段-复垦中心分发
    YS_FKZXYS = 3.4, //验收阶段-复垦中心验收
    YS_JSKQR = 3.5, //验收阶段-技术科确认前汇总
    YS_XJQR = 3.6, //验收阶段-县级确认
    YS_SJYYSBG = 3.7, //验收阶段-市级预验收报告
    YS_SJYSBH = 3.8, //验收阶段-市级验收便函
    YS_GBYSBHQR = 3.81, //验收阶段-耕保验收便函确认
    YS_XJTX = 3.82, //验收阶段-县级填写省级扣减面积
    YS_ZXFYSBG = 3.83, //验收阶段-中心发验收报告
    YS_SJNYSPW = 3.84, //验收阶段-市级拟验收批文
    YS_GBYSPWQR = 3.85, //验收阶段-耕保验收批文确认
    YS_PASS = 3.9, //验收阶段-验收结束通过

    NOPASS = 64.0, //不通过
}